---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.Altitude
source: html/7dac428d-6e9e-dd74-afcd-9fb86f863054.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.Altitude Property

Altitude setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings
 element that uses lighting mode.

## Syntax (C#)
```csharp
public double Altitude { get; set; }
```